In [1]:
import numpy as np
import pandas as pd

In [2]:
movies = pd.read_csv('movies.dat', sep = '::', header = None )
ratings = pd.read_csv('ratings.dat', sep = '::',header = None )

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.
C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [3]:
movies.shape, ratings.shape

((3883, 3), (1000209, 4))

In [4]:
ratings.columns = ['User_id', 'Movie_id', 'Ratings', 'Timestamp']
movies.columns = ['Movie_id', 'Title', 'Genre']

In [5]:
category  =[]
for i in range(len(movies['Genre'])):
    category.append(movies['Genre'][i].split('|'))
    
category = pd.DataFrame(category)

In [6]:
category.columns = ['category 1','category 2', 'category 3','category 4','category 5','category 6']

In [7]:
movies['category 1'] = category['category 1']
movies['category 2'] = category['category 2']

In [8]:
movies.head()

,Movie_id,Title,Genre,category 1,category 2
0,1,Toy Story (1995),Animation|Children's|Comedy,Animation,Children's
1,2,Jumanji (1995),Adventure|Children's|Fantasy,Adventure,Children's
2,3,Grumpier Old Men (1995),Comedy|Romance,Comedy,Romance
3,4,Waiting to Exhale (1995),Comedy|Drama,Comedy,Drama
4,5,Father of the Bride Part II (1995),Comedy,Comedy,None

In [9]:
movies.drop('Genre', inplace=True, axis =1)

In [10]:
movies.head()

   Movie_id                               Title category 1  category 2
0         1                    Toy Story (1995)  Animation  Children's
1         2                      Jumanji (1995)  Adventure  Children's
2         3             Grumpier Old Men (1995)     Comedy     Romance
3         4            Waiting to Exhale (1995)     Comedy       Drama
4         5  Father of the Bride Part II (1995)     Comedy        None

In [11]:
data = ratings.groupby('User_id')

In [12]:
user_1 = data.get_group(4)

In [13]:
user_1.shape

(21, 4)

In [14]:
umid = user_1['Movie_id'].tolist()

In [15]:
len(umid)

21

In [16]:
#user_2 = data.get_group(2)

In [17]:
good_rate_1 = user_1[user_1['Ratings']>3]
#good_rate_2 = user_2[user_2['Ratings']>3]

In [18]:
data_1 = pd.merge(movies, good_rate_1, on='Movie_id') 
#data_2 = pd.merge(movies, good_rate_2, on='Movie_id')
data_1.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,260,Star Wars: Episode IV - A New Hope (1977),Action,Adventure,4,5,978294199
1,480,Jurassic Park (1993),Action,Adventure,4,4,978294008
2,1036,Die Hard (1988),Action,Thriller,4,4,978294282
3,1097,E.T. the Extra-Terrestrial (1982),Children's,Drama,4,4,978293964
4,1198,Raiders of the Lost Ark (1981),Action,Adventure,4,5,978294199

In [19]:
c11 = pd.DataFrame(data_1['category 1'])
c21 = pd.DataFrame(data_1['category 2'])
c11.columns = ['genre']
c21.columns = ['genre']
# c12 = pd.DataFrame(data_2['category 1'])
# c22 = pd.DataFrame(data_2['category 2'])
# c12.columns = ['genre']
# c22.columns = ['genre']

In [20]:
Genre_1 = pd.concat([c11,c21], ignore_index = True)
#Genre_2 = pd.concat([c12,c22], ignore_index = True)

In [21]:
Genre_1.head()

        genre
0      Action
1      Action
2      Action
3  Children's
4      Action

In [22]:
genre_count_1 = pd.value_counts(Genre_1['genre'])
#genre_count_2 = pd.value_counts(Genre_2['genre'])
genre_count_1

Action        16
Drama          5
Adventure      4
Sci-Fi         2
Horror         2
Western        2
Crime          1
Thriller       1
Children's     1
Name: genre, dtype: int64

In [23]:
top_genre_1 = max(genre_count_1.items(), key = lambda x: x[1])
#top_genre_2 = max(genre_count_2.items(), key = lambda x: x[1])
top_genre_1
#top_genre_2

('Action', 16)

In [24]:
top_rated = ratings[(ratings['Ratings'] == 4) | (ratings['Ratings'] == 5)]

In [25]:
recMovies = movies[(movies['category 1'] == top_genre_1[0]) | (movies['category 2'] == top_genre_1[0])]

In [26]:
dataset = pd.merge(recMovies, top_rated, on='Movie_id') 
dataset.head()

   Movie_id        Title category 1 category 2  User_id  Ratings  Timestamp
0         6  Heat (1995)     Action      Crime        7        4  978234842
1         6  Heat (1995)     Action      Crime       15        4  978198250
2         6  Heat (1995)     Action      Crime       36        5  978211343
3         6  Heat (1995)     Action      Crime       42        4  978040956
4         6  Heat (1995)     Action      Crime       48        4  977976243

In [27]:
mid1 = dataset['Movie_id']

In [28]:
mid = mid1.drop_duplicates().tolist()

In [29]:
len(mid)

485

In [30]:
dataset = pd.merge(recMovies, top_rated, on='Movie_id') 
dataset.head()

   Movie_id        Title category 1 category 2  User_id  Ratings  Timestamp
0         6  Heat (1995)     Action      Crime        7        4  978234842
1         6  Heat (1995)     Action      Crime       15        4  978198250
2         6  Heat (1995)     Action      Crime       36        5  978211343
3         6  Heat (1995)     Action      Crime       42        4  978040956
4         6  Heat (1995)     Action      Crime       48        4  977976243

In [31]:
dataset = dataset.drop_duplicates(subset='Movie_id',)
dataset['Title']

0                                            Heat (1995)
652                                  Sudden Death (1995)
676                                     GoldenEye (1995)
1163                             Cutthroat Island (1995)
1194                                  Money Train (1995)
1214                                   Get Shorty (1995)
2001                              Dead Presidents (1995)
2059                                Mortal Kombat (1995)
2139                          From Dusk Till Dawn (1996)
2526                                    Fair Game (1995)
2537                                 Nick of Time (1995)
2611                                 Broken Arrow (1996)
2794                                   Braveheart (1995)
4771                          Rumble in the Bronx (1995)
5063                                       Target (1995)
5064                                     Bad Boys (1995)
5230                               Batman Forever (1995)
5393                                        Congo (1995)
5454                                    Desperado (1995)
5727                   Die Hard: With a Vengeance (1995)
6189                                 First Knight (1995)
6311                                      Hackers (1995)
6432                              Johnny Mnemonic (1995)
6525                                  Judge Dredd (1995)
6602      Mighty Morphin Power Rangers: The Movie (1995)
6608                                 Strange Days (1995)
6875                Under Siege 2: Dark Territory (1995)
6939                                   Waterworld (1995)
7089                                    Drop Zone (1994)
7114                                  Hunted, The (1995)
                               ...
134115                               Fatal Beauty (1987)
134123                         Gone in 60 Seconds (2000)
134332                     Assault on Precinct 13 (1976)
134384                                      Shaft (1971)
134492                Big Trouble in Little China (1986)
134789                                      Shaft (2000)
134967                               Patriot, The (2000)
135773                         Perfect Storm, The (2000)
136244                                        F/X (1986)
136636                                      F/X 2 (1992)
136679                          Missing in Action (1984)
136717         Missing in Action 2: The Beginning (1985)
136726            Braddock: Missing in Action III (1988)
136735                  Thunderbolt and Lightfoot (1974)
136828               Golden Voyage of Sinbad, The (1974)
136895                            Shaft in Africa (1973)
136903                         Shaft's Big Score! (1972)
136913                                      X-Men (2000)
137955                                   Freejack (1992)
137997                               Knightriders (1981)
138005            Sinbad and the Eye of the Tiger (1977)
138052                              Space Cowboys (2000)
138286                             Kelly's Heroes (1970)
138562                                Air America (1990)
138626    Godzilla 2000 (Gojira ni-sen mireniamu) (1999)
138669                                  Supergirl (1984)
138683                            Art of War, The (2000)
138720                        Highlander: Endgame (2000)
138745                                       Bait (2000)
138754                                 Get Carter (2000)
Name: Title, Length: 485, dtype: object

In [32]:
dataset.shape

(485, 7)

In [33]:
dataset.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,6,Heat (1995),Action,Crime,7,4,978234842
652,9,Sudden Death (1995),Action,None,65,5,986615324
676,10,GoldenEye (1995),Action,Adventure,18,5,978153344
1163,15,Cutthroat Island (1995),Action,Adventure,103,5,977555887
1194,20,Money Train (1995),Action,None,195,4,977471326

In [34]:
recc = {'movie_id':[],'Movie_Name':[]}
for i in range(len(dataset['Movie_id'])):
    for j in range(len(data_1['Movie_id'])):
        if dataset['Movie_id'].iloc[i] != data_1['Movie_id'].iloc[j]:
            recc['movie_id'].append(recMovies['Movie_id'].iloc[i])
            recc['Movie_Name'].append(recMovies['Title'].iloc[i])
            #recc['Movie_Rating'].append(dataset['Ratings'].iloc[j])
            #,'Movie_Rating':[]

In [35]:
recc = pd.DataFrame(recc)

In [36]:
recc = recc.drop_duplicates(subset='movie_id')

In [37]:
recc.shape

(485, 2)

In [38]:
recc.head()

    movie_id               Movie_Name
0          6              Heat (1995)
18         9      Sudden Death (1995)
36        10         GoldenEye (1995)
54        15  Cutthroat Island (1995)
72        20       Money Train (1995)